---
kind: other
id: Properties.T:Autodesk.Revit.DB.PolylineNode
source: html/d20538e4-f337-318d-7036-afc6b3b430f9.htm
---
# PolylineNode Properties

Specifies whether the .NET object represents a valid Revit entity.